   // 4:
      //  Store s = new Store();
        // לא, בגלל שזה Private  אפשר להדפיס רק במחלקה ולא בmain
        // 6:
        //כדי להדגיש שהשדה שייכת למחלקה
       // משמעות this():
        // מדובר בקריאה לctor אחר באותה המחלקה
        //10:
        //yesss
        //11:
        //כן, כי GETTER זו פונקציה שמחזירה את הערך
       // באמצעות GETTER אני יכולה לקרוא לשדה מבחוץ אך לא אוכל לשנות אותו, אלא רק בתוך המחלקה
       //SETTER פונקציה שמשנה לי את הערך
       //בגלל שבשגה נתון FINAL ךא נוכל לעשות SETTER כי הערך שנתנו לנו סופי ולא ניתן לשנותו
       //9:
       //כן
        //12:
        //כדור הארץ יורש מכוכבי לכת
